package exception;

public class ExceptionConspect {
    // Что такое исключения в Java?
// Какие виды исключений знаете?
// Какие существуют способы обработки исключений?
// В Java есть пять ключевых слов для работы с исключениями:
/***
 1. try – данное ключевое слово используется для отметки начала блока кода, который потенциально может привести к ошибке.
 2. catch – ключевое слово для отметки начала блока кода, предназначенного для перехвата и обработки исключений.
 3. finally – ключевое слово для отметки начала блока кода, которой является дополнительным.
 Этот блок помещается после последнего блока 'catch'. Управление обычно передаётся в блок 'finally' в любом случае.
 4. throw – служит для генерации исключений.
 5. throws – ключевое слово, которое прописывается в сигнатуре метода, и обозначающее что метод потенциально может выбросить исключение с указанным типом.
 ***/
}
